Tutorial_benchmark_with_CoSimIO_2_interfaces/system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//Used when we want to run the simulation in parallel
/*
    numberOfSubdomains 25;

    method hierarchical;
    hierarchicalCoeffs
    {
        n (5 5 1);
        delta 0.0001;
        order xyz;
    }

    distributed false;
    roots
    (
    );
*/

